<template>
  <h1>Speak comrade!</h1>
  <p v-for="(par, i) in pars" :key="i">{{ par }}</p>
</template>

<script>
import {ref} from 'vue';

export default {
  name: 'App',
  setup() {
    let speechData = [
      ['Как вы могли заметить,', 'С другой стороны,', 'Равным образом', 'Не следует, однако, забывать, что', 'Таким образом,', 'Повседневная практика показывает, что'],
      ['реализация намеченных плановых заданий', 'рамки и место обучения кадров', 'постоянный количественный рост и сфера нашей активности', 'сложивщаяся структура организации', 'новая модель организационной деятельности', 'дальнейшее развитие различных форм деятельности'],
      ['играет важную роль в формировании', 'требует от нас анализа', 'требует определения и уточнения', 'способствует подготовке и реализации', 'способствует подготовке и реализации', 'обеспечивает широкому кругу специалистов участие в формировании', 'позволяет выполнить важные задания по разработке'],
      ['существенных финансовых и административных условий', 'дальнейших направлений развития', 'системы массового участия', 'позиций, занимаемых участниками в отношении поставленных задач', 'новых предложений', 'направлений прогрессивного развития']
    ]

    const shuffle = array => array.sort(() => .5 - Math.random());
    const transpose = array => array[0].map((x, i) => array.map(x => x[i]))

    function printSpeech() {
      for (let i in speechData) {
        speechData[i] = shuffle(speechData[i])
      }

      let speech = ['Товарищи!']
      let speechArray = transpose(speechData)
      for (let i in speechArray) {
        speech.push(speechArray[i].join(' '))
      }

      return speech
    }

    const pars = ref(printSpeech())

    return {
      pars
    }
  }
}

</script>